       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLTUT.
       AUTHOR. YONEEKIM.
       DATE-WRITTEN. AUGUST 28TH 2023.
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.


       STOP RUN.
